#  이진 트리(Binary Tree)는 각 노드가 최대 두 개의 자식 노드를 가지는 트리 구조입니다. 이진 트리에서 왼쪽 자식은 해당 노드의 값보다 작거나 같은 값을 가지고, 오른쪽 자식은 해당 노드의 값보다 큰 값을 가집니다. 이진 트리는 다양한 형태로 나타날 수 있으며, 이에 따라 정렬된 이진 트리, 균형 이진 트리 등 다양한 종류가 있습니다.
#  완전 이진 트리(Complete Binary Tree)는 마지막 레벨을 제외하고 모든 레벨이 완전히 채워진 이진 트리입니다. 마지막 레벨은 왼쪽부터 노드가 차례로 채워져 있을 수 있고, 가장 오른쪽 노드가 비어 있을 수도 있습니다.
#  이진 힙(Binary Heap)은 완전 이진 트리의 한 종류로서, 최대 힙(Max Heap)과 최소 힙(Min Heap)으로 나뉩니다.
#  최대 힙(Max Heap): 각 노드의 값이 그 자식 노드의 값보다 크거나 같은 힙입니다. 루트 노드는 최대값을 가지게 됩니다.
#  최소 힙(Min Heap): 각 노드의 값이 그 자식 노드의 값보다 작거나 같은 힙입니다. 루트 노드는 최소값을 가지게 됩니다.
#  힙은 일반적으로 우선순위 큐(Priority Queue)를 구현하는 데 사용됩니다. 힙에서는 원소의 삽입과 삭제가 효율적으로 이루어집니다. 이때, 완전 이진 트리의 구조를 유지하면서 원소들을 추가하거나 삭제하는 연산이 수행됩니다.


